# Write a Python program to sum all the items in a list.

# PRACTICE--1

In [126]:
l=[2,3,4,5,5]
def fun(l):
    sum_n=0
    for i in l:
        sum_n+=i
    print("Sum of total numbers in the given list is--",sum_n)
fun(l)

Sum of total numbers in the given list is-- 19

# write a Python program to count the number of strings where the string length is 2 or  more and the first and last character are same from a given list of string.

In [127]:
l=input("Enter list of strings").split(",")
def match(l):
    r=0
    for i in l:
        if len(i)>2 and i[0]==i[-1]:
            r+=1
    return r
match(l)

Enter list of strings

0

# write a Python program to remove duplicates from a list.

In [128]:
lst=[20,3,45,5,6,10,10,45,3,25,46]
dup_items=set()
uniq_items=[]
for x in lst:
    if x not in dup_items:
        uniq_items.append(x)
        dup_items.add(x)
print(dup_items)

{3, 5, 6, 10, 45, 46, 20, 25}

In [129]:
l=[4,34,54,56,67,7,6]
d_s=set()
print(d_s)

set()

In [130]:
s=set()
type(s)

set

# PRACTICE--2

# #Write a Python program to check if all dictionaries in a list are empty or not.

In [131]:
list1=[{},{},{},{}]
list2=[{1233,567},{},3,'kvkmk']
print(all(not x for x in list1))
print(all(not x1 for x1  in list2))

True
False

In [132]:
'''try:
    ex=5/0
    print(ex)
except Exception as e:
    print(e)
#except:
 #   print("There is something wrong with my try block")
'''

'try:\n    ex=5/0\n    print(ex)\nexcept Exception as e:\n    print(e)\n#except:\n #   print("There is something wrong with my try block")\n'

In [133]:
'''try:
    print("this is new line")
except:
    print("there is any issue")
else:
    print("Now else block will be ready to execute")
'''

'try:\n    print("this is new line")\nexcept:\n    print("there is any issue")\nelse:\n    print("Now else block will be ready to execute")\n'

# #Write a Python program to remove duplicates from a list of lists.

In [134]:
import itertools
num=[40,20,30,40,50,50,40,30,40,50,60]
print("Original List ",num)
num.sort()
new_list=list(num for num ,_ in itertools.groupby(num))
print("New List",new_list)

Original List  [40, 20, 30, 40, 50, 50, 40, 30, 40, 50, 60]
New List [20, 30, 40, 50, 60]

# #Write a Python program to extend a list without append.

In [135]:
x=[20,30,40,50]
y=[60,70,80]
x+y

[20, 30, 40, 50, 60, 70, 80]

In [136]:
x=[20,30,40,50]
y=[60,70,80,90]
x[:0]=y
print(x)

[60, 70, 80, 90, 20, 30, 40, 50]

In [137]:
x=[20,30,40,50]
y=[60,70,80,90]
x[0]=y
print(x)

[[60, 70, 80, 90], 30, 40, 50]

In [138]:
x=[20,30,40,50]
y=[60,70,80,90]
x[2]=y
print(x)

[20, 30, [60, 70, 80, 90], 50]

# #Write a Python program to find the list in a list of lists whose sum of elements is the highest

In [139]:
x=[[2,3,4,5],[10,30,20,40],[4,5,6,7],[4,5,3,7]]
print(max(x))

[10, 30, 20, 40]

In [140]:
x=[[2,3,4,5],[10,30,20,40],[4,5,6,7],[4,5,3,7]]
print(max(x,key=sum))

[10, 30, 20, 40]

# #Write a Python program to access dictionary keyâ€™s element by index.

In [141]:
dict1={'stats':20,"eng":67,'math':28}
#print(dict1,type(dict1))
print(list(dict1)[0])

stats

# #Write a Python program to iterate over two lists simultaneously.

In [142]:
num=[1,2,3]
colors=['red','black','white']
for i,j in zip(num,colors):
    print(i,j)

1 red
2 black
3 white

# #write a program to inser a string at the begining of every elements in a list

In [143]:
a=[100,110,120,130,140,354,654]
print(['custumer{0}'.format(i) for i in a])

['custumer100', 'custumer110', 'custumer120', 'custumer130', 'custumer140', 'custumer354', 'custumer654']

In [144]:
a=[100,110,120,130,140,354,654]
print(['@@{0}'.format(i) for i in a])

['@@100', '@@110', '@@120', '@@130', '@@140', '@@354', '@@654']

# # write a program to take two lists and print if they have at least one common member

In [145]:
l1=[10,20,30,40]
l2=[40,50,60,70]
def common_member(l1,l2):
    result=False
    for x in l1:
        for y in l2:
            if x==y:
                result=True
                return result

In [146]:
print(common_member(l1,l2))

True

In [147]:
print(common_member([2,3,4,5,6],[7,8,9,10,11]))

None

# # compute all permutations in a list

In [148]:
import itertools
print(list(itertools.permutations([12,22,23])))

[(12, 22, 23), (12, 23, 22), (22, 12, 23), (22, 23, 12), (23, 12, 22), (23, 22, 12)]

# PRACTICE--3

# Write a program to sort by key

In [149]:
dict1={"data":'123',
      'science':'234',
      "AI":'456'}
print(dict1)

{'data': '123', 'science': '234', 'AI': '456'}

In [150]:
for x in sorted(dict1):
    print("%s:%s" %(x,dict1[x]))

AI:456
data:123
science:234

In [151]:
for x in sorted(dict1):
    print(x,dict1[x])

AI 456
data 123
science 234

# #Write a Python program to get a dictionary from an object's fields.

In [152]:
class dictobject(object):
    def __init__(self):
        self.name="Tulsi"
        self.surname='Jha'
        self.age=20
    def do_nothing(self):
        pass

In [153]:
obj=dictobject()
print(dictobject.__dict__)

{'__module__': '__main__', '__init__': <function dictobject.__init__ at 0x000001924ACC28B8>, 'do_nothing': <function dictobject.do_nothing at 0x000001924ACC21F8>, '__dict__': <attribute '__dict__' of 'dictobject' objects>, '__weakref__': <attribute '__weakref__' of 'dictobject' objects>, '__doc__': None}

In [154]:
obj=dictobject()
print(obj.__dict__)

{'name': 'Tulsi', 'surname': 'Jha', 'age': 20}

# # write a program to remove duplicates from Dictionary.

In [155]:
student_data={
    "id1":{"name":'Sara',
           "clas":'V',
           "subject_integration":['eng','math','science']
          },
    'id2':{"name":"Surya",
          "clas":'X',
          "subject_integration":['eng','math','science']
          },
    'id3':{"name":"Sra",
          "clas":'V',
          "subject_integration":['eng','math','science']
          },
}

In [156]:
print(student_data)

{'id1': {'name': 'Sara', 'clas': 'V', 'subject_integration': ['eng', 'math', 'science']}, 'id2': {'name': 'Surya', 'clas': 'X', 'subject_integration': ['eng', 'math', 'science']}, 'id3': {'name': 'Sra', 'clas': 'V', 'subject_integration': ['eng', 'math', 'science']}}

In [157]:

result={}
for key,value in student_data.items():
    if value not in result.values():
        result[key]=value
print(result)

{'id1': {'name': 'Sara', 'clas': 'V', 'subject_integration': ['eng', 'math', 'science']}, 'id2': {'name': 'Surya', 'clas': 'X', 'subject_integration': ['eng', 'math', 'science']}, 'id3': {'name': 'Sra', 'clas': 'V', 'subject_integration': ['eng', 'math', 'science']}}

# # write a program to combine two dictionary adding values for common keys

In [158]:

from collections import Counter
d1={'a':100,'b':200,'c':300}
d2={'a':400,'b':500,'c':600}
d=Counter(d1)+Counter(d2)
print(d)

Counter({'c': 900, 'b': 700, 'a': 500})

# # write a program to print all unique values from a dictionary in a list

In [159]:
data = [{"V":"S001"}, {"V": "S002"}, {"VI": "S001"}, {"VI": "S005"}, {"VII":"S005"}, {
"V":"S009"},{"VIII":"S007"}]

print(data)

[{'V': 'S001'}, {'V': 'S002'}, {'VI': 'S001'}, {'VI': 'S005'}, {'VII': 'S005'}, {'V': 'S009'}, {'VIII': 'S007'}]

In [160]:
u_value=set(val for dic in data for val in dic.values())

In [161]:
print(u_value)

{'S001', 'S007', 'S002', 'S005', 'S009'}

# PRACTICE--4

# #1. create a sample JSON object from titanic train dataset

In [165]:
data="https://raw.githubusercontent.com/pcsanwald/kaggle-titanic/master/train.csv"
print(data)

https://raw.githubusercontent.com/pcsanwald/kaggle-titanic/master/train.csv

In [170]:
import pandas as pd
#df=pd.read_csv(data)
df=pd.read_csv(data)
df

,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [173]:
data

'https://raw.githubusercontent.com/pcsanwald/kaggle-titanic/master/train.csv'

In [174]:
df.head()

,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# #2. read the HTML file as given below

In [7]:
url='http://vincentarelbundock.github.io/Rdatasets/datasets.html'
print(url)

http://vincentarelbundock.github.io/Rdatasets/datasets.html

In [8]:
#crete the data frame from the above object
import pandas as pd
df=pd.read_html(url)
df

[                                                Package          Item  \
 0                                                  boot          acme
 1                                                  boot          aids
 2                                                  boot     aircondit
 3                                                  boot    aircondit7
 4                                                  boot          amis
 ...                                                 ...           ...
 1299                                                vcd  VisualAcuity
 1300                                                vcd       VonBort
 1301                                                vcd    WeldonDice
 1302                                                vcd    WomenQueue
 1303  Package Item Title Rows Cols n_binary n_charac...           NaN

                                              Title    Rows  Cols  n_binary  \
 0                           Monthly Excess Returns    60.0   3.0       0.0
 1     Delay in AIDS Reporting in England and Wales   570.0   6.0       1.0
 2           Failures of Air-conditioning Equipment    12.0   1.0       0.0
 3           Failures of Air-conditioning Equipment    24.0   1.0       0.0
 4                   Car Speeding and Warning Signs  8437.0   4.0       1.0
 ...                                            ...     ...   ...       ...
 1299          Visual Acuity in Left and Right Eyes    32.0   4.0       1.0
 1300              Von Bortkiewicz Horse Kicks Data   280.0   4.0       1.0
 1301                            Weldon's Dice Data    11.0   2.0       0.0
 1302                               Women in Queues    11.0   2.0       0.0
 1303                                           NaN     NaN   NaN       NaN

       n_character  n_factor  n_logical  n_numeric  CSV  Doc
 0             1.0       0.0        0.0        2.0  CSV  DOC
 1             0.0       0.0        0.0        6.0  CSV  DOC
 2             0.0       0.0        0.0        1.0  CSV  DOC
 3             0.0       0.0        0.0        1.0  CSV  DOC
 4             0.0       0.0        0.0        4.0  CSV  DOC
 ...           ...       ...        ...        ...  ...  ...
 1299          0.0       3.0        0.0        1.0  CSV  DOC
 1300          0.0       2.0        0.0        2.0  CSV  DOC
 1301          0.0       1.0        0.0        1.0  CSV  DOC
 1302          0.0       1.0        0.0        1.0  CSV  DOC
 1303          NaN       NaN        NaN        NaN  NaN  NaN

 [1304 rows x 12 columns],
      Package          Item                                         Title  \
 0       boot          acme                        Monthly Excess Returns
 1       boot          aids  Delay in AIDS Reporting in England and Wales
 2       boot     aircondit        Failures of Air-conditioning Equipment
 3       boot    aircondit7        Failures of Air-conditioning Equipment
 4       boot          amis                Car Speeding and Warning Signs
 ...      ...           ...                                           ...
 1298     vcd      UKSoccer                              UK Soccer Scores
 1299     vcd  VisualAcuity          Visual Acuity in Left and Right Eyes
 1300     vcd       VonBort              Von Bortkiewicz Horse Kicks Data
 1301     vcd    WeldonDice                            Weldon's Dice Data
 1302     vcd    WomenQueue                               Women in Queues

       Rows  Cols  n_binary  n_character  n_factor  n_logical  n_numeric  CSV  \
 0       60     3         0            1         0          0          2  CSV
 1      570     6         1            0         0          0          6  CSV
 2       12     1         0            0         0          0          1  CSV
 3       24     1         0            0         0          0          1  CSV
 4     8437     4         1            0         0          0          4  CSV
 ...    ...   ...       ...          ...       ...        ...        ...  ...
 1298    25     3         0            0         2          0          1  CSV
 1299    32     4         1            0         3          0          1  CSV
 1300   280     4         1            0         2          0          2  CSV
 1301    11     2         0            0         1          0          1  CSV
 1302    11     2         0            0         1          0          1  CSV

       Doc
 0     DOC
 1     DOC
 2     DOC
 3     DOC
 4     DOC
 ...   ...
 1298  DOC
 1299  DOC
 1300  DOC
 1301  DOC
 1302  DOC

 [1303 rows x 12 columns]]

In [11]:
## Create URL to JSON file (alternatively this can be a filepath)

url = 'https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/data.json'

print(url)

https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/data.json

In [12]:
# Load the first sheet of the JSON file into a data frame
df = pd.read_json(url,orient='columns')
df

    integer            datetime  category
0         5 2015-01-01 00:00:00         0
1         5 2015-01-01 00:00:01         0
2         9 2015-01-01 00:00:02         0
3         6 2015-01-01 00:00:03         0
4         6 2015-01-01 00:00:04         0
..      ...                 ...       ...
95        9 2015-01-01 00:01:35         0
96        8 2015-01-01 00:01:36         0
97        6 2015-01-01 00:01:37         0
98        8 2015-01-01 00:01:38         0
99        1 2015-01-01 00:01:39         0

[100 rows x 3 columns]

In [13]:
df.head(10)

   integer            datetime  category
0        5 2015-01-01 00:00:00         0
1        5 2015-01-01 00:00:01         0
2        9 2015-01-01 00:00:02         0
3        6 2015-01-01 00:00:03         0
4        6 2015-01-01 00:00:04         0
5        9 2015-01-01 00:00:05         0
6        7 2015-01-01 00:00:06         0
7        1 2015-01-01 00:00:07         0
8        6 2015-01-01 00:00:08         0
9        9 2015-01-01 00:00:09         0

# PRACTICE--4

#create a tuple from multiple data types

In [14]:
tuple1=(1,2.3,'hello',2+3j,False)
print(tuple1)

(1, 2.3, 'hello', (2+3j), False)

In [15]:
a=('try','except','tuple','list')
b=(2.3,4.5,6.7,8.9)
c=(2,3,4,6,7)
d=(True,False,True)

In [16]:
tuple2=(a,b,c,d)
tuple2

(('try', 'except', 'tuple', 'list'),
 (2.3, 4.5, 6.7, 8.9),
 (2, 3, 4, 6, 7),
 (True, False, True))

# Create a list of length 3 and Create a list of length 4, For each element in the first list,

# Display the corresponding index element of the second list

In [17]:
list1=[2,3.4,'tryyy']
list2=[3,4.5,True,'hii']
for i,j in zip(list1,list2):
    print(i,j)

2 3
3.4 4.5
tryyy True

In [19]:
header=['Data science','Algorithm','Stats']
match=['data science','algorithm','python','stats']

for header,match in zip(header,match):
    print(header,'has the folloeing options:',match)

Data science has the folloeing options: data science
Algorithm has the folloeing options: algorithm
Stats has the folloeing options: python

In [20]:
# display an example of Nested For Loops Using List Comprehension
# Create a list of length 3:
headers = ['data science', 'Blue mix', 'algorithms']
# Create a list of length 4:
matches = ['Red hat', 'Blue mixx','Green gold','Orange Ai']
[(header,match) for header in headers for match in matches]

[('data science', 'Red hat'),
 ('data science', 'Blue mixx'),
 ('data science', 'Green gold'),
 ('data science', 'Orange Ai'),
 ('Blue mix', 'Red hat'),
 ('Blue mix', 'Blue mixx'),
 ('Blue mix', 'Green gold'),
 ('Blue mix', 'Orange Ai'),
 ('algorithms', 'Red hat'),
 ('algorithms', 'Blue mixx'),
 ('algorithms', 'Green gold'),
 ('algorithms', 'Orange Ai')]

In [21]:
#write a program for breaking and exiting out of loop
# Create a list:
armies = ['Red Army', 'Blue Army', 'Green Army']

In [25]:
for army in armies:
    print(army)
    if army=='Blue Army':
        print("Blue Army Found!!stopping")
        break

Red Army
Blue Army
Blue Army Found!!stopping

In [26]:
#A loop will exit when completed, but using an else statement we can add an action at t
#he conclusion of the loop if it hasnâ€™t been exited earlier.

In [28]:
armies = ['Red Army', 'Blue Army', 'Green Army']
for army in armies:
    print(army)
    if army=='Orange Army':
        break
else:
    print("Looped Thrugh the whole list,but no orange army found!!")

Red Army
Blue Army
Green Army
Looped Thrugh the whole list,but no orange army found!!